# 입력을 받습니다.
year = input("태어난 년도를 입력> ")

year = int(year)

# 조건문을 이용하여 출력합니다.
if year % 12 == 0:
    print("똑똑할 것 같아.....원숭이 띠 인 것 같은디...")
elif year % 12 == 1:
    print("혹시..치킨 띠...?")
elif year % 12 == 2:
    print("댕댕끼가 느껴지는디..혹시 개띠...?")
elif year % 12 == 3:
    print("킁킁 뭔가..먹을 복이 있는 거 같은디....귀여운 돼지 띠...?")
elif year % 12 == 4:
    print("좀 영리해보이는디...혹시 찍찍 쥐띠...?")
elif year % 12 == 5:
    print("뭔가 웅장해보이는데...혹시 소띠....?")
elif year % 12 == 6:
    print("오오오오오 강력해보이는데...혹시 범띠...?")
elif year % 12 == 7:
    print("엄....기다려 봐....생각 중이야.....;;혹시 달에서 활동하나요?? 토끼...?!!!?!")
elif year % 12 == 8:
    print("뭔가 가슴이 웅장해진다...정말 그...강력크한 용띠 인가욥...?!!?!?!")
elif year % 12 == 9:
    print("뭔가 퇴폐미(?)느껴지는디....아!! 뱀띠구나..그거 겁나 멋집니다!")
elif year % 12 == 10:
    print("엄.....이 분 달리기가 빠를 것 같아....말 띠 맞죠? ㅎㅎ")
elif year % 12 == 11:
    print("이 분 디게 따뜻할 것 같아....양 띠!!")
